app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1  [["user_id", 1]]
---
  def index
    @notes = Note.where(user_id: @user.id)

INSERT INTO "notes" ("id", "message", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 1], ["message", "please please sign in"], ["user_id", 1], ["created_at", "2021-03-04 03:39:42.727441"], ["updated_at", "2021-03-04 03:39:42.727441"]]
---
  def create
    @note = Note.new(note_params)
    @note.user_id = @user.id

    if @note.save